GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_sfsqi.c
/*
 * Copyright (c) 2016-2021 Thomas Roell.  All rights reserved.
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to
 * deal with the Software without restriction, including without limitation the
 * rights to use, copy, modify, merge, publish, distribute, sublicense, and/or
 * sell copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 *  1. Redistributions of source code must retain the above copyright notice,
 *     this list of conditions and the following disclaimers.
 *  2. Redistributions in binary form must reproduce the above copyright
 *     notice, this list of conditions and the following disclaimers in the
 *     documentation and/or other materials provided with the distribution.
 *  3. Neither the name of Thomas Roell, nor the names of its contributors
 *     may be used to endorse or promote products derived from this Software
 *     without specific prior written permission.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.  IN NO EVENT SHALL THE
 * CONTRIBUTORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING
 * FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS
 * WITH THE SOFTWARE.
 */

#include "armv7m.h"
#include "stm32wb_gpio.h"
#include "stm32wb_sfsqi.h"
#include "stm32wb_sflash.h"
#include "stm32wb_system.h"

#define STM32WB_SFSQI_CCR_DDR                    (QUADSPI_CCR_DDRM)
#define STM32WB_SFSQI_CCR_WRITE                  (0)
#define STM32WB_SFSQI_CCR_READ                   (QUADSPI_CCR_FMODE_0)
#define STM32WB_SFSQI_CCR_WAIT                   (QUADSPI_CCR_FMODE_1)
#define STM32WB_SFSQI_CCR_DATA_SINGLE            (QUADSPI_CCR_DMODE_0)
#define STM32WB_SFSQI_CCR_DATA_DUAL              (QUADSPI_CCR_DMODE_1)
#define STM32WB_SFSQI_CCR_DATA_QUAD              (QUADSPI_CCR_DMODE_0 | QUADSPI_CCR_DMODE_1)
#define STM32WB_SFSQI_CCR_MODE_SINGLE            (QUADSPI_CCR_ABMODE_0)
#define STM32WB_SFSQI_CCR_MODE_DUAL              (QUADSPI_CCR_ABMODE_1)
#define STM32WB_SFSQI_CCR_MODE_QUAD              (QUADSPI_CCR_ABMODE_0 | QUADSPI_CCR_ABMODE_1)
#define STM32WB_SFSQI_CCR_MODE_SINGLE_8          (QUADSPI_CCR_ABMODE_0)
#define STM32WB_SFSQI_CCR_MODE_SINGLE_16         (QUADSPI_CCR_ABMODE_0 | QUADSPI_CCR_ABSIZE_0)
#define STM32WB_SFSQI_CCR_MODE_SINGLE_24         (QUADSPI_CCR_ABMODE_0 | QUADSPI_CCR_ABSIZE_1)
#define STM32WB_SFSQI_CCR_MODE_SINGLE_32         (QUADSPI_CCR_ABMODE_0 | QUADSPI_CCR_ABSIZE_0 | QUADSPI_CCR_ABSIZE_1)
#define STM32WB_SFSQI_CCR_MODE_DUAL_8            (QUADSPI_CCR_ABMODE_1)
#define STM32WB_SFSQI_CCR_MODE_DUAL_16           (QUADSPI_CCR_ABMODE_1 | QUADSPI_CCR_ABSIZE_0)
#define STM32WB_SFSQI_CCR_MODE_DUAL_24           (QUADSPI_CCR_ABMODE_1 | QUADSPI_CCR_ABSIZE_1)
#define STM32WB_SFSQI_CCR_MODE_DUAL_32           (QUADSPI_CCR_ABMODE_1 | QUADSPI_CCR_ABSIZE_0 | QUADSPI_CCR_ABSIZE_1)
#define STM32WB_SFSQI_CCR_MODE_QUAD_8            (QUADSPI_CCR_ABMODE_0 | QUADSPI_CCR_ABMODE_1)
#define STM32WB_SFSQI_CCR_MODE_QUAD_16           (QUADSPI_CCR_ABMODE_0 | QUADSPI_CCR_ABMODE_1 | QUADSPI_CCR_ABSIZE_0)
#define STM32WB_SFSQI_CCR_MODE_QUAD_24           (QUADSPI_CCR_ABMODE_0 | QUADSPI_CCR_ABMODE_1 | QUADSPI_CCR_ABSIZE_1)
#define STM32WB_SFSQI_CCR_MODE_QUAD_32           (QUADSPI_CCR_ABMODE_0 | QUADSPI_CCR_ABMODE_1 | QUADSPI_CCR_ABSIZE_0 | QUADSPI_CCR_ABSIZE_1)
#define STM32WB_SFSQI_CCR_DCYCLE_2               (2 << QUADSPI_CCR_DCYC_Pos)
#define STM32WB_SFSQI_CCR_DCYCLE_3               (3 << QUADSPI_CCR_DCYC_Pos)
#define STM32WB_SFSQI_CCR_DCYCLE_4               (4 << QUADSPI_CCR_DCYC_Pos)
#define STM32WB_SFSQI_CCR_DCYCLE_5               (5 << QUADSPI_CCR_DCYC_Pos)
#define STM32WB_SFSQI_CCR_DCYCLE_6               (6 << QUADSPI_CCR_DCYC_Pos)
#define STM32WB_SFSQI_CCR_DCYCLE_7               (7 << QUADSPI_CCR_DCYC_Pos)
#define STM32WB_SFSQI_CCR_DCYCLE_8               (8 << QUADSPI_CCR_DCYC_Pos)
#define STM32WB_SFSQI_CCR_DCYCLE_10              (10 << QUADSPI_CCR_DCYC_Pos)
#define STM32WB_SFSQI_CCR_ADDR_SINGLE_8          (QUADSPI_CCR_ADMODE_0)
#define STM32WB_SFSQI_CCR_ADDR_SINGLE_16         (QUADSPI_CCR_ADMODE_0 | QUADSPI_CCR_ADSIZE_0)
#define STM32WB_SFSQI_CCR_ADDR_SINGLE_24         (QUADSPI_CCR_ADMODE_0 | QUADSPI_CCR_ADSIZE_1)
#define STM32WB_SFSQI_CCR_ADDR_SINGLE_32         (QUADSPI_CCR_ADMODE_0 | QUADSPI_CCR_ADSIZE_0 | QUADSPI_CCR_ADSIZE_1)
#define STM32WB_SFSQI_CCR_ADDR_DUAL_8            (QUADSPI_CCR_ADMODE_1)
#define STM32WB_SFSQI_CCR_ADDR_DUAL_16           (QUADSPI_CCR_ADMODE_1 | QUADSPI_CCR_ADSIZE_0)
#define STM32WB_SFSQI_CCR_ADDR_DUAL_24           (QUADSPI_CCR_ADMODE_1 | QUADSPI_CCR_ADSIZE_1)
#define STM32WB_SFSQI_CCR_ADDR_DUAL_32           (QUADSPI_CCR_ADMODE_1 | QUADSPI_CCR_ADSIZE_0 | QUADSPI_CCR_ADSIZE_1)
#define STM32WB_SFSQI_CCR_ADDR_QUAD_8            (QUADSPI_CCR_ADMODE_0 | QUADSPI_CCR_ADMODE_1)
#define STM32WB_SFSQI_CCR_ADDR_QUAD_16           (QUADSPI_CCR_ADMODE_0 | QUADSPI_CCR_ADMODE_1 | QUADSPI_CCR_ADSIZE_0)
#define STM32WB_SFSQI_CCR_ADDR_QUAD_24           (QUADSPI_CCR_ADMODE_0 | QUADSPI_CCR_ADMODE_1 | QUADSPI_CCR_ADSIZE_1)
#define STM32WB_SFSQI_CCR_ADDR_QUAD_32           (QUADSPI_CCR_ADMODE_0 | QUADSPI_CCR_ADMODE_1 | QUADSPI_CCR_ADSIZE_0 | QUADSPI_CCR_ADSIZE_1)
#define STM32WB_SFSQI_CCR_INSN_SINGLE            (QUADSPI_CCR_IMODE_0)
#define STM32WB_SFSQI_CCR_INSN_DUAL              (QUADSPI_CCR_IMODE_1)
#define STM32WB_SFSQI_CCR_INSN_QUAD              (QUADSPI_CCR_IMODE_0 | QUADSPI_CCR_IMODE_1)

#define STM32WB_SFSQI_INSN_WRSR                  0x01
#define STM32WB_SFSQI_INSN_RDSR                  0x05
#define STM32WB_SFSQI_INSN_WREN                  0x06
#define STM32WB_SFSQI_INSN_RES                   0x90
#define STM32WB_SFSQI_INSN_RDID                  0x9f

#define STM32WB_SFSQI_SR_WIP                     0x01 /* write in progress */
#define STM32WB_SFSQI_SR_WEL                     0x02 /* write enable latch */

#define STM32WB_SFSQI_CCR_SECTOR_ERASE           (0x20 | STM32WB_SFSQI_CCR_INSN_SINGLE | STM32WB_SFSQI_CCR_ADDR_SINGLE_24)
#define STM32WB_SFSQI_CCR_BLOCK_ERASE            (0xd8 | STM32WB_SFSQI_CCR_INSN_SINGLE | STM32WB_SFSQI_CCR_ADDR_SINGLE_24)

#define STM32WB_SFSQI_CCR_1_1_1_PAGE_PROGRAM     (0x02 | STM32WB_SFSQI_CCR_INSN_SINGLE | STM32WB_SFSQI_CCR_ADDR_SINGLE_24 | STM32WB_SFSQI_CCR_DATA_SINGLE)
#define STM32WB_SFSQI_CCR_1_1_2_PAGE_PROGRAM     (0xa2 | STM32WB_SFSQI_CCR_INSN_SINGLE | STM32WB_SFSQI_CCR_ADDR_SINGLE_24 | STM32WB_SFSQI_CCR_DATA_DUAL)
#define STM32WB_SFSQI_CCR_1_2_2_PAGE_PROGRAM     (0xd2 | STM32WB_SFSQI_CCR_INSN_SINGLE | STM32WB_SFSQI_CCR_ADDR_DUAL_24 | STM32WB_SFSQI_CCR_DATA_DUAL)
#define STM32WB_SFSQI_CCR_1_1_4_PAGE_PROGRAM     (0x32 | STM32WB_SFSQI_CCR_INSN_SINGLE | STM32WB_SFSQI_CCR_ADDR_SINGLE_24 | STM32WB_SFSQI_CCR_DATA_QUAD)
#define STM32WB_SFSQI_CCR_1_4_4_PAGE_PROGRAM     (0x38 | STM32WB_SFSQI_CCR_INSN_SINGLE | STM32WB_SFSQI_CCR_ADDR_QUAD_24 | STM32WB_SFSQI_CCR_DATA_QUAD)

