GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_sfsqi.c
#define STM32WB_SFSQI_CCR_1_1_1_READ             (0x03 | STM32WB_SFSQI_CCR_INSN_SINGLE | STM32WB_SFSQI_CCR_ADDR_SINGLE_24 | STM32WB_SFSQI_CCR_DATA_SINGLE | STM32WB_SFSQI_CCR_READ)
#define STM32WB_SFSQI_CCR_1_1_1_FAST_READ        (0x0b | STM32WB_SFSQI_CCR_INSN_SINGLE | STM32WB_SFSQI_CCR_ADDR_SINGLE_24 | STM32WB_SFSQI_CCR_DCYCLE_8 | STM32WB_SFSQI_CCR_DATA_SINGLE | STM32WB_SFSQI_CCR_READ)
#define STM32WB_SFSQI_CCR_1_1_2_D8_READ          (0x3b | STM32WB_SFSQI_CCR_INSN_SINGLE | STM32WB_SFSQI_CCR_ADDR_SINGLE_24 | STM32WB_SFSQI_CCR_DCYCLE_8 | STM32WB_SFSQI_CCR_DATA_DUAL | STM32WB_SFSQI_CCR_READ)
#define STM32WB_SFSQI_CCR_1_1_4_D8_READ          (0x6b | STM32WB_SFSQI_CCR_INSN_SINGLE | STM32WB_SFSQI_CCR_ADDR_SINGLE_24 | STM32WB_SFSQI_CCR_DCYCLE_8 | STM32WB_SFSQI_CCR_DATA_QUAD | STM32WB_SFSQI_CCR_READ)
#define STM32WB_SFSQI_CCR_1_2_2_M2D2_READ        (0xbb | STM32WB_SFSQI_CCR_INSN_SINGLE | STM32WB_SFSQI_CCR_ADDR_DUAL_24 | STM32WB_SFSQI_CCR_MODE_QUAD_8 | STM32WB_SFSQI_CCR_DCYCLE_2 | STM32WB_SFSQI_CCR_DATA_DUAL | STM32WB_SFSQI_CCR_READ)
#define STM32WB_SFSQI_CCR_1_4_4_M2D4_READ        (0xeb | STM32WB_SFSQI_CCR_INSN_SINGLE | STM32WB_SFSQI_CCR_ADDR_QUAD_24 | STM32WB_SFSQI_CCR_MODE_QUAD_8 | STM32WB_SFSQI_CCR_DCYCLE_4 | STM32WB_SFSQI_CCR_DATA_QUAD | STM32WB_SFSQI_CCR_READ)

#define STM32WB_SFSQI_MID_SPANSION               0x01
#define STM32WB_SFSQI_MID_MACRONIX               0xc2
#define STM32WB_SFSQI_MID_WINBOND                0xef

/* MACRONIX */
#define STM32WB_SFSQI_INSN_RDCONF                0x15
#define STM32WB_SFSQI_INSN_WRSCUR                0x2f
#define STM32WB_SFSQI_INSN_RDSCUR                0x2b
#define STM32WB_SFSQI_INSN_WREAR                 0xc5
#define STM32WB_SFSQI_INSN_PERSUS                0xb0
#define STM32WB_SFSQI_INSN_PERRSM                0x30
#define STM32WB_SFSQI_INSN_RSTEN                 0x66
#define STM32WB_SFSQI_INSN_RST                   0x99
#define STM32WB_SFSQI_INSN_RDPD                  0xab
#define STM32WB_SFSQI_INSN_DPD                   0xb9
#define STM32WB_SFSQI_INSN_EN4B                  0xb7
#define STM32WB_SFSQI_INSN_EX4B                  0xe9

#define STM32WB_SFSQI_SR_QE                      0x40
#define STM32WB_SFSQI_CONF2_HPM                  0x02
#define STM32WB_SFSQI_SCUR_PSB                   0x08
#define STM32WB_SFSQI_SCUR_ESB                   0x10
#define STM32WB_SFSQI_SCUR_P_FAIL                0x20
#define STM32WB_SFSQI_SCUR_E_FAIL                0x40

/* SPANSION */
#define STM32WB_SFSQI_INSN_RDSR2                 0x07
#define STM32WB_SFSQI_INSN_RDCR                  0x35
#define STM32WB_SFSQI_INSN_CLSR                  0x30
#define STM32WB_SFSQI_INSN_BRWR                  0x17
#define STM32WB_SFSQI_INSN_ERSP                  0x75
#define STM32WB_SFSQI_INSN_ERRS                  0x7a
#define STM32WB_SFSQI_INSN_PGSP                  0x85
#define STM32WB_SFSQI_INSN_PGRS                  0x8a
#define STM32WB_SFSQI_INSN_RESET                 0xf0

#define STM32WB_SFSQI_SR_P_ERR                   0x40
#define STM32WB_SFSQI_SR_E_ERR                   0x20
#define STM32WB_SFSQI_CR_QE                      0x02
#define STM32WB_SFSQI_SR2_PS                     0x01
#define STM32WB_SFSQI_SR2_ES                     0x02

#define STM32WB_SFSQI_BR_EXTADD                  0x80

/* WINBOND */
#define STM32WB_SFSQI_INSN_WREN_VOLATILE         0x50
#define STM32WB_SFSQI_INSN_WREAR                 0xc5
#define STM32WB_SFSQI_INSN_EPS                   0x75
#define STM32WB_SFSQI_INSN_EPR                   0x7a
#define STM32WB_SFSQI_INSN_RSTEN                 0x66
#define STM32WB_SFSQI_INSN_RST                   0x99
#define STM32WB_SFSQI_INSN_RDPD                  0xab
#define STM32WB_SFSQI_INSN_DPD                   0xb9
#define STM32WB_SFSQI_INSN_EN4B                  0xb7
#define STM32WB_SFSQI_INSN_EX4B                  0xe9

#define STM32WB_SFSQI_SR2_QE                     0x02
#define STM32WB_SFSQI_SR2_SUS                    0x80


#define STM32WB_SFSQI_STATE_NONE                 0
#define STM32WB_SFSQI_STATE_NOT_READY            1
#define STM32WB_SFSQI_STATE_READY                2
#define STM32WB_SFSQI_STATE_DATA                 3
#define STM32WB_SFSQI_STATE_WAIT                 4

#define STM32WB_SFSQI_BUSY_ERASE                 0x01
#define STM32WB_SFSQI_BUSY_PROGRAM               0x02
#define STM32WB_SFSQI_BUSY_SLEEP                 0x04
#define STM32WB_SFSQI_BUSY_SUSPENDED_ERASE       0x08
#define STM32WB_SFSQI_BUSY_SUSPENDED_PROGRAM     0x10


typedef struct _stm32wb_sfsqi_device_t {
    volatile uint8_t               state;
    uint8_t                        busy;
    stm32wb_sfsqi_pins_t           pins;
    stm32wb_sflash_info_t          info;
    stm32wb_system_notify_t        notify;
    QUADSPI_TypeDef                *QSPI;
    uint32_t                       clock;
    uint32_t                       hclk;
    uint32_t                       sclk;
    uint32_t                       cr;
    uint32_t                       ccr_erase;
    uint32_t                       ccr_program;
    uint32_t                       ccr_read;
    uint8_t                        insn_erase_suspend;
    uint8_t                        insn_erase_resume;
    uint8_t                        insn_program_suspend;
    uint8_t                        insn_program_resume;
    volatile uint8_t               *p_status_return;
} stm32wb_sfsqi_device_t;

static stm32wb_sfsqi_device_t stm32wb_sfsqi_device;

static void stm32wb_sfsqi_status(uint8_t status);
static bool stm32wb_sfsqi_busy(void);

static inline __attribute__((optimize("O3"),always_inline)) uint8_t STM32WB_SFSQI_READ_8(QUADSPI_TypeDef *QSPI)
{
    volatile uint8_t *fifo = (volatile uint8_t*)((uint32_t)&QSPI->DR);

    return *fifo;
}

static inline __attribute__((optimize("O3"),always_inline)) void STM32WB_SFSQI_WRITE_8(QUADSPI_TypeDef *QSPI, const uint8_t data)
{
    volatile uint8_t *fifo = (volatile uint8_t*)((uint32_t)&QSPI->DR);

    *fifo = data;
}

static inline __attribute__((optimize("O3"),always_inline)) uint16_t STM32WB_SFSQI_READ_16(QUADSPI_TypeDef *QSPI)
{
    volatile uint16_t *fifo = (volatile uint16_t*)((uint32_t)&QSPI->DR);

