GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_sfsqi.c
    return *fifo;
}

static inline __attribute__((optimize("O3"),always_inline)) void STM32WB_SFSQI_WRITE_16(QUADSPI_TypeDef *QSPI, const uint16_t data)
{
    volatile uint16_t *fifo = (volatile uint16_t*)((uint32_t)&QSPI->DR);

    *fifo = data;
}

static inline __attribute__((optimize("O3"),always_inline)) uint32_t STM32WB_SFSQI_READ_32(QUADSPI_TypeDef *QSPI)
{
    volatile uint32_t *fifo = (volatile uint32_t*)((uint32_t)&QSPI->DR);

    return *fifo;
}

static inline __attribute__((optimize("O3"),always_inline)) void STM32WB_SFSQI_WRITE_32(QUADSPI_TypeDef *QSPI, const uint32_t data)
{
    volatile uint32_t *fifo = (volatile uint32_t*)((uint32_t)&QSPI->DR);

    *fifo = data;
}

static inline void stm32wb_sfsqi_start(void)
{
    QUADSPI_TypeDef *QSPI = stm32wb_sfsqi_device.QSPI;
    uint32_t hclk, presc;
    
    stm32wb_system_lock(STM32WB_SYSTEM_LOCK_SLEEP_0);

    hclk = stm32wb_system_hclk();

    if (stm32wb_sfsqi_device.hclk != hclk)
    {
	stm32wb_sfsqi_device.hclk = hclk;

	if (stm32wb_sfsqi_device.clock >= hclk)
	{
	    presc = 1;
	}
	else
	{
	    presc = (hclk + (stm32wb_sfsqi_device.clock -1)) / stm32wb_sfsqi_device.clock;
	}
	
	stm32wb_sfsqi_device.sclk = hclk / presc;
	stm32wb_sfsqi_device.cr = ((presc -1) << QUADSPI_CR_PRESCALER_Pos) | ((8 -1) << QUADSPI_CR_FTHRES_Pos) | QUADSPI_CR_APMS | QUADSPI_CR_SSHIFT | QUADSPI_CR_SMIE | QUADSPI_CR_EN;
    }
    
    stm32wb_system_periph_enable(STM32WB_SYSTEM_PERIPH_QSPI);
    
    QSPI->DCR = QUADSPI_DCR_FSIZE | ((2 -1) << QUADSPI_DCR_CSHT_Pos);
    QSPI->ABR = 0x88;
    QSPI->CR = stm32wb_sfsqi_device.cr;
}

static inline void stm32wb_sfsqi_stop(void)
{
    QUADSPI_TypeDef *QSPI = stm32wb_sfsqi_device.QSPI;

    while (QSPI->SR & QUADSPI_SR_BUSY) { }
    
    QSPI->CR = 0;
    
    stm32wb_system_periph_disable(STM32WB_SYSTEM_PERIPH_QSPI);

    stm32wb_system_unlock(STM32WB_SYSTEM_LOCK_SLEEP_0);
}

static inline __attribute__((optimize("O3"),always_inline)) void stm32wb_sfsqi_command(uint8_t insn)
{
    QUADSPI_TypeDef *QSPI = stm32wb_sfsqi_device.QSPI;

    while (QSPI->SR & QUADSPI_SR_BUSY) { }

    QSPI->CCR = insn | STM32WB_SFSQI_CCR_INSN_SINGLE;
}

static inline __attribute__((optimize("O3"),always_inline)) uint8_t stm32wb_sfsqi_command_read_1(uint8_t insn)
{
    QUADSPI_TypeDef *QSPI = stm32wb_sfsqi_device.QSPI;
    uint8_t data_0;

    while (QSPI->SR & QUADSPI_SR_BUSY) { }

    QSPI->DLR = 0;
    QSPI->CCR = insn | STM32WB_SFSQI_CCR_INSN_SINGLE | STM32WB_SFSQI_CCR_DATA_SINGLE | STM32WB_SFSQI_CCR_READ;

    while (!(QSPI->SR & QUADSPI_SR_TCF)) { }

    data_0 = STM32WB_SFSQI_READ_8(QSPI);

    QSPI->FCR = QUADSPI_FCR_CTCF;

    return data_0;
}

static inline __attribute__((optimize("O3"),always_inline)) void stm32wb_sfsqi_command_read_2(uint8_t insn, uint8_t *p_data_0, uint8_t *p_data_1)
{
    QUADSPI_TypeDef *QSPI = stm32wb_sfsqi_device.QSPI;

    while (QSPI->SR & QUADSPI_SR_BUSY) { }

    QSPI->DLR = 1;
    QSPI->CCR = insn | STM32WB_SFSQI_CCR_INSN_SINGLE | STM32WB_SFSQI_CCR_DATA_SINGLE | STM32WB_SFSQI_CCR_READ;

    while (!(QSPI->SR & QUADSPI_SR_TCF)) { }

    *p_data_0 = STM32WB_SFSQI_READ_8(QSPI);
    *p_data_1 = STM32WB_SFSQI_READ_8(QSPI);

    QSPI->FCR = QUADSPI_FCR_CTCF;
}

static inline __attribute__((optimize("O3"),always_inline)) void stm32wb_sfsqi_command_read_3(uint8_t insn, uint8_t *p_data_0, uint8_t *p_data_1, uint8_t *p_data_2)
{
    QUADSPI_TypeDef *QSPI = stm32wb_sfsqi_device.QSPI;

    while (QSPI->SR & QUADSPI_SR_BUSY) { }

    QSPI->DLR = 2;
    QSPI->CCR = insn | STM32WB_SFSQI_CCR_INSN_SINGLE | STM32WB_SFSQI_CCR_DATA_SINGLE | STM32WB_SFSQI_CCR_READ;

    while (!(QSPI->SR & QUADSPI_SR_TCF)) { }

    *p_data_0 = STM32WB_SFSQI_READ_8(QSPI);
    *p_data_1 = STM32WB_SFSQI_READ_8(QSPI);
    *p_data_2 = STM32WB_SFSQI_READ_8(QSPI);

    QSPI->FCR = QUADSPI_FCR_CTCF;
}

static inline __attribute__((optimize("O3"),always_inline)) void stm32wb_sfsqi_command_write_1(uint8_t insn, uint8_t data_0)
{
    QUADSPI_TypeDef *QSPI = stm32wb_sfsqi_device.QSPI;

    while (QSPI->SR & QUADSPI_SR_BUSY) { }

    QSPI->DLR = 0;
    QSPI->CCR = insn | STM32WB_SFSQI_CCR_INSN_SINGLE | STM32WB_SFSQI_CCR_DATA_SINGLE;

    STM32WB_SFSQI_WRITE_8(QSPI, data_0);

    while (!(QSPI->SR & QUADSPI_SR_TCF)) { }

    QSPI->FCR = QUADSPI_FCR_CTCF;
}

static inline __attribute__((optimize("O3"),always_inline)) void stm32wb_sfsqi_command_write_2(uint8_t insn, uint8_t data_0, uint8_t data_1)
{
    QUADSPI_TypeDef *QSPI = stm32wb_sfsqi_device.QSPI;

    while (QSPI->SR & QUADSPI_SR_BUSY) { }

    QSPI->DLR = 1;
    QSPI->CCR = insn | STM32WB_SFSQI_CCR_INSN_SINGLE | STM32WB_SFSQI_CCR_DATA_SINGLE;

    STM32WB_SFSQI_WRITE_8(QSPI, data_0);
    STM32WB_SFSQI_WRITE_8(QSPI, data_1);

    while (!(QSPI->SR & QUADSPI_SR_TCF)) { }

    QSPI->FCR = QUADSPI_FCR_CTCF;
}

static inline __attribute__((optimize("O3"),always_inline)) void stm32wb_sfsqi_command_write_3(uint8_t insn, uint8_t data_0, uint8_t data_1, uint8_t data_2)
{
    QUADSPI_TypeDef *QSPI = stm32wb_sfsqi_device.QSPI;

    while (QSPI->SR & QUADSPI_SR_BUSY) { }

    QSPI->DLR = 2;
    QSPI->CCR = insn | STM32WB_SFSQI_CCR_INSN_SINGLE | STM32WB_SFSQI_CCR_DATA_SINGLE;

    STM32WB_SFSQI_WRITE_8(QSPI, data_0);
    STM32WB_SFSQI_WRITE_8(QSPI, data_1);
    STM32WB_SFSQI_WRITE_8(QSPI, data_2);

    while (!(QSPI->SR & QUADSPI_SR_TCF)) { }

    QSPI->FCR = QUADSPI_FCR_CTCF;
}

static inline __attribute__((optimize("O3"),always_inline)) uint8_t stm32wb_sfsqi_command_signature(void)
{
    QUADSPI_TypeDef *QSPI = stm32wb_sfsqi_device.QSPI;
    uint8_t signature;
    
    while (QSPI->SR & QUADSPI_SR_BUSY) { }

    QSPI->DLR = 0;
    QSPI->CCR = STM32WB_SFSQI_INSN_RES | (STM32WB_SFSQI_CCR_INSN_SINGLE | STM32WB_SFSQI_CCR_ADDR_SINGLE_24 | STM32WB_SFSQI_CCR_DATA_SINGLE | STM32WB_SFSQI_CCR_READ);
    QSPI->AR  = 0;    

    while (!(QSPI->SR & QUADSPI_SR_TCF)) { }

    signature = STM32WB_SFSQI_READ_8(QSPI);

    QSPI->FCR = QUADSPI_FCR_CTCF;

    return signature;
}

static inline __attribute__((optimize("O3"),always_inline)) void stm32wb_sfsqi_command_erase(uint32_t address)
{
    QUADSPI_TypeDef *QSPI = stm32wb_sfsqi_device.QSPI;

    while (QSPI->SR & QUADSPI_SR_BUSY) { }

