GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_sfsqi.c
    QSPI->CCR = stm32wb_sfsqi_device.ccr_erase;
    QSPI->AR  = address;    
}

static inline __attribute__((optimize("O3"),always_inline)) void stm32wb_sfsqi_command_program(uint32_t address, const uint8_t *data, uint32_t count)
{
    QUADSPI_TypeDef *QSPI = stm32wb_sfsqi_device.QSPI;
    uint32_t data_0, data_1, data_2, data_3;
    const uint32_t *data32, *data32_e;
    const uint16_t *data16;
    const uint8_t *data8, *data_e;
    
    while (QSPI->SR & QUADSPI_SR_BUSY) { }

    QSPI->DLR = count -1;
    QSPI->CCR = stm32wb_sfsqi_device.ccr_program;
    QSPI->AR  = address;    

    if (count > 16)
    {
	if ((uint32_t)data & 3)
	{
	    data_e = data + count;

	    if ((uint32_t)data & 1)
	    {
		data8 = (const uint8_t*)data;
		
		STM32WB_SFSQI_WRITE_8(QSPI, *data8++);
		
		data = (const uint8_t*)data8;
	    }
	    
	    if ((uint32_t)data & 2)
	    {
		data16 = (const uint16_t*)data;
		
		STM32WB_SFSQI_WRITE_16(QSPI, *data16++);
		
		data = (const uint8_t*)data16;
	    }
	    
	    count = data_e - data;
	}
	
        data32 = (const uint32_t*)(data);
	data32_e = (const uint32_t*)(data + (count & ~7));

	do
	{
	    data_0 = data32[0];
	    data_1 = data32[1];

	    __asm__ volatile("": : : "memory");

	    while (!(QSPI->SR & QUADSPI_SR_FTF)) { }
	    
	    STM32WB_SFSQI_WRITE_32(QSPI, data_0);
	    STM32WB_SFSQI_WRITE_32(QSPI, data_1);

	    __asm__ volatile("": : : "memory");

	    data32 += 2;
	}
	while (data32 != data32_e);

	if (count & 7)
	{
	    data = (const uint8_t*)data32;

	    while (!(QSPI->SR & QUADSPI_SR_FTF)) { }

	    if (count & 4)
	    {
		data32 = (const uint32_t*)data;

		STM32WB_SFSQI_WRITE_32(QSPI, *data32++);
	    
		data = (const uint8_t*)data32;
	    }

	    if (count & 2)
	    {
		data16 = (const uint16_t*)data;
		
		STM32WB_SFSQI_WRITE_16(QSPI, *data16++);
		
		data = (const uint8_t*)data16;
	    }
	    
	    if (count & 1)
	    {
		data8 = (const uint8_t*)data;

		STM32WB_SFSQI_WRITE_8(QSPI, *data8);
	    }
	}
    }
    else
    {
	if (count > 3)
	{
	    if ((uint32_t)data & 3)
	    {
		data_e = data + count;

		if ((uint32_t)data & 1)
		{
		    data8 = (const uint8_t*)data;
		    
		    STM32WB_SFSQI_WRITE_8(QSPI, *data8++);
		    
		    data = (const uint8_t*)data8;
		}
		
		if ((uint32_t)data & 2)
		{
		    data16 = (const uint16_t*)data;
		    
		    STM32WB_SFSQI_WRITE_16(QSPI, *data16++);
		    
		    data = (const uint8_t*)data16;
		}
		
		count = data_e - data;
	    }
	    
	    if (count & 16)
	    {
		data32 = (const uint32_t*)data;

		data_0 = data32[0];
		data_1 = data32[1];
		data_2 = data32[2];
		data_3 = data32[3];
		
		__asm__ volatile("": : : "memory");
	    
		STM32WB_SFSQI_WRITE_32(QSPI, data_0);
		STM32WB_SFSQI_WRITE_32(QSPI, data_1);
		STM32WB_SFSQI_WRITE_32(QSPI, data_2);
		STM32WB_SFSQI_WRITE_32(QSPI, data_3);
		
		__asm__ volatile("": : : "memory");
	    }
	    else
	    {
		if (count & 8)
		{
		    data32 = (const uint32_t*)data;

		    data_0 = data32[0];
		    data_1 = data32[1];
		    
		    __asm__ volatile("": : : "memory");
	    
		    STM32WB_SFSQI_WRITE_32(QSPI, data_0);
		    STM32WB_SFSQI_WRITE_32(QSPI, data_1);
		    
		    __asm__ volatile("": : : "memory");
		    
		    data32 += 2;
		    
		    data = (const uint8_t*)data32;
		}
		
		if (count & 4)
		{
		    data32 = (const uint32_t*)data;
		    
		    STM32WB_SFSQI_WRITE_32(QSPI, *data32++);
		    
		    data = (const uint8_t*)data32;
		}
		
		if (count & 2)
		{
		    data16 = (const uint16_t*)data;
	    
		    STM32WB_SFSQI_WRITE_16(QSPI, *data16++);
		    
		    data = (const uint8_t*)data16;
		}
		
		if (count & 1)
		{
		    data8 = (const uint8_t*)data;
		    
		    STM32WB_SFSQI_WRITE_8(QSPI, *data8);
		}
	    }
	}
	else
	{
	    if (count >= 3)
	    {
		STM32WB_SFSQI_WRITE_8(QSPI, *data++);
	    }

	    if (count >= 2)
	    {
		STM32WB_SFSQI_WRITE_8(QSPI, *data++);
	    }

	    STM32WB_SFSQI_WRITE_8(QSPI, *data);
	}
    }
    
    while (!(QSPI->SR & QUADSPI_SR_TCF)) { }
    
    QSPI->FCR = QUADSPI_FCR_CTCF;
}

static inline __attribute__((optimize("O3"),always_inline)) void stm32wb_sfsqi_command_read(uint32_t address, uint8_t *data, uint32_t count)
{
    QUADSPI_TypeDef *QSPI = stm32wb_sfsqi_device.QSPI;
    uint32_t data_0, data_1, data_2, data_3;
    uint32_t *data32, *data32_e;
    uint16_t *data16;
    uint8_t *data8, *data_e;

    while (QSPI->SR & QUADSPI_SR_BUSY) { }

    QSPI->DLR = count -1;
    QSPI->CCR = stm32wb_sfsqi_device.ccr_read;
    QSPI->AR  = address;
    
    if (count > 16)
    {
	if ((uint32_t)data & 3)
	{
	    data_e = data + count;

	    while (!(QSPI->SR & QUADSPI_SR_FTF)) { }

	    if ((uint32_t)data & 1)
	    {
		data8 = (uint8_t*)data;
		
		*data8++ = STM32WB_SFSQI_READ_8(QSPI);
		
		data = (uint8_t*)data8;
	    }
	    
	    if ((uint32_t)data & 2)
	    {
		data16 = (uint16_t*)data;
		
		*data16++ = STM32WB_SFSQI_READ_16(QSPI);
		
		data = (uint8_t*)data16;
	    }
	    
	    count = data_e - data;
	}
	
	data32 = (uint32_t*)(data);
	data32_e = (uint32_t*)(data + (count & ~7));

	do
	{
	    __asm__ volatile("": : : "memory");

	    while (!(QSPI->SR & QUADSPI_SR_FTF)) { }
		
	    data_0 = STM32WB_SFSQI_READ_32(QSPI);
	    data_1 = STM32WB_SFSQI_READ_32(QSPI);

	    __asm__ volatile("": : : "memory");
	    
	    data32[0] = data_0;
	    data32[1] = data_1;

	    data32 += 2;
	}
	while (data32 != data32_e);

	while (!(QSPI->SR & QUADSPI_SR_TCF)) { }
	
	if (count & 7)
	{
	    data = (void*)data32;

	    if (count & 4)
	    {
		data32 = (uint32_t*)data;

		*data32++ = STM32WB_SFSQI_READ_32(QSPI);
		
		data = (uint8_t*)data32;
	    }

	    if (count & 2)
	    {
		data16 = (uint16_t*)data;

		*data16++ = STM32WB_SFSQI_READ_16(QSPI);
		
		data = (uint8_t*)data16;
	    }

	    if (count & 1)
	    {
		data8 = (uint8_t*)data;

		*data8 = STM32WB_SFSQI_READ_8(QSPI);
	    }
	}
    }
    else
    {
	while (!(QSPI->SR & QUADSPI_SR_TCF)) { }

	if (count > 3)
	{
	    if ((uint32_t)data & 3)
	    {
		data_e = data + count;

		if ((uint32_t)data & 1)
		{
		    data8 = (uint8_t*)data;
		    
		    *data8++ = STM32WB_SFSQI_READ_8(QSPI);
		    
