GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_sfsqi.c
		    data = (uint8_t*)data8;
		}
		
		if ((uint32_t)data & 2)
		{
		    data16 = (uint16_t*)data;
		    
		    *data16++ = STM32WB_SFSQI_READ_16(QSPI);
		    
		    data = (uint8_t*)data16;
		}
		
		count = data_e - data;
	    }
	    
	    if (count & 16)
	    {
		data32 = (uint32_t*)data;
		    
		__asm__ volatile("": : : "memory");
		    
		data_0 = STM32WB_SFSQI_READ_32(QSPI);
		data_1 = STM32WB_SFSQI_READ_32(QSPI);
		data_2 = STM32WB_SFSQI_READ_32(QSPI);
		data_3 = STM32WB_SFSQI_READ_32(QSPI);
		    
		__asm__ volatile("": : : "memory");
		    
		data32[0] = data_0;
		data32[1] = data_1;
		data32[2] = data_2;
		data32[3] = data_3;
	    }
	    else
	    {
		if (count & 8)
		{
		    data32 = (uint32_t*)data;
	    
		    __asm__ volatile("": : : "memory");
			
		    data_0 = STM32WB_SFSQI_READ_32(QSPI);
		    data_1 = STM32WB_SFSQI_READ_32(QSPI);
			
		    __asm__ volatile("": : : "memory");
			
		    data32[0] = data_0;
		    data32[1] = data_1;
			
		    data32 += 2;
			
		    data = (uint8_t*)data32;
		}
		    
		if (count & 4)
		{
		    data32 = (uint32_t*)data;
	    
		    *data32++ = STM32WB_SFSQI_READ_32(QSPI);
			
		    data = (uint8_t*)data32;
		}
	
		if (count & 2)
		{
		    data16 = (uint16_t*)data;
	    
		    *data16++ = STM32WB_SFSQI_READ_16(QSPI);
			
		    data = (uint8_t*)data16;
		}
		    
		if (count & 1)
		{
		    data8 = (uint8_t*)data;
			
		    *data8 = STM32WB_SFSQI_READ_8(QSPI);
		}
	    }
	}
	else
	{
	    if (count > 2)
	    {
		*data++ = STM32WB_SFSQI_READ_8(QSPI);
	    }

	    if (count >= 2)
	    {
		*data++ = STM32WB_SFSQI_READ_8(QSPI);
	    }
	    
	    *data++ = STM32WB_SFSQI_READ_8(QSPI);
	}
    }
    
    QSPI->FCR = QUADSPI_FCR_CTCF;
}

static __attribute__((optimize("O3"),noinline)) uint8_t stm32wb_sfsqi_write_enable(void)
{
    uint8_t status;
    
    do
    {
	stm32wb_sfsqi_command(STM32WB_SFSQI_INSN_WREN);

	status = stm32wb_sfsqi_command_read_1(STM32WB_SFSQI_INSN_RDSR);
    }
    while (!(status & STM32WB_SFSQI_SR_WEL));

    return status;
}

static bool stm32wb_sfsqi_acquire(void)
{
    if (stm32wb_sfsqi_device.state < STM32WB_SFSQI_STATE_NOT_READY)
    {
	return false;
    }

    stm32wb_sfsqi_start();

    if (stm32wb_sfsqi_device.busy & STM32WB_SFSQI_BUSY_SLEEP)
    {
	stm32wb_sfsqi_command(STM32WB_SFSQI_INSN_RDPD);
	
        armv7m_core_udelay(50);

	stm32wb_sfsqi_device.busy &= ~STM32WB_SFSQI_BUSY_SLEEP;
    }
    
    if (stm32wb_sfsqi_device.state != STM32WB_SFSQI_STATE_NOT_READY)
    {
	stm32wb_sfsqi_device.state = STM32WB_SFSQI_STATE_DATA;
    }

    return true;
}

static bool stm32wb_sfsqi_release(void)
{
    if (stm32wb_sfsqi_device.state < STM32WB_SFSQI_STATE_NOT_READY)
    {
	return false;
    }

    stm32wb_sfsqi_stop();
    
    if (stm32wb_sfsqi_device.state != STM32WB_SFSQI_STATE_NOT_READY)
    {
	stm32wb_sfsqi_device.state = STM32WB_SFSQI_STATE_READY;
    }
    
    return true;
}

static void stm32wb_sfsqi_sleep(void)
{
    bool success;
    
    if (stm32wb_sfsqi_device.state != STM32WB_SFSQI_STATE_READY)
    {
	return;
    }

    if (stm32wb_sfsqi_device.busy & STM32WB_SFSQI_BUSY_SLEEP)
    {
	return;
    }

    if (stm32wb_sfsqi_device.info.mid == STM32WB_SFSQI_MID_SPANSION)
    {
	return;
    }

    if (!stm32wb_sfsqi_acquire())
    {
	return;
    }

    success = true;
    
    if (stm32wb_sfsqi_busy())
    {
	success = false;
    }

    if (success)
    {
	stm32wb_sfsqi_command(STM32WB_SFSQI_INSN_DPD);

	stm32wb_sfsqi_device.busy |= STM32WB_SFSQI_BUSY_SLEEP;
    }
    
    stm32wb_sfsqi_release();
}

static __attribute__((optimize("O3"),noinline)) void stm32wb_sfsqi_status(uint8_t status)
{
    uint8_t scur;
    bool success;
    
    success = true;

    if (stm32wb_sfsqi_device.info.mid == STM32WB_SFSQI_MID_MACRONIX)
    {
	scur = stm32wb_sfsqi_command_read_1(STM32WB_SFSQI_INSN_RDSCUR);

	if (stm32wb_sfsqi_device.busy & STM32WB_SFSQI_BUSY_ERASE)
	{
	    if (scur & STM32WB_SFSQI_SCUR_E_FAIL)
	    {
		success = false;
	    }
	}
	else
	{
	    if (scur & STM32WB_SFSQI_SCUR_P_FAIL)
	    {
		success = false;
	    }
	}
    }
    
    if (stm32wb_sfsqi_device.info.mid == STM32WB_SFSQI_MID_SPANSION)
    {
	if (status & (STM32WB_SFSQI_SR_E_ERR | STM32WB_SFSQI_SR_P_ERR))
	{
	    stm32wb_sfsqi_command(STM32WB_SFSQI_INSN_CLSR);
	    
	    success = false;
	}
    }
    
    if (stm32wb_sfsqi_device.p_status_return)
    {
	*stm32wb_sfsqi_device.p_status_return = success ? STM32WB_SFLASH_STATUS_SUCCESS : STM32WB_SFLASH_STATUS_FAILURE;
    }
    
    stm32wb_sfsqi_device.busy &= ~(STM32WB_SFSQI_BUSY_ERASE | STM32WB_SFSQI_BUSY_PROGRAM);
}

static __attribute__((optimize("O3"),noinline)) bool stm32wb_sfsqi_busy(void)
{
    uint8_t status;
    
    if (stm32wb_sfsqi_device.state != STM32WB_SFSQI_STATE_DATA)
    {
	return false;
    }

    if (!(stm32wb_sfsqi_device.busy & (STM32WB_SFSQI_BUSY_ERASE | STM32WB_SFSQI_BUSY_PROGRAM)))
    {
	return false;
    }

    status = stm32wb_sfsqi_command_read_1(STM32WB_SFSQI_INSN_RDSR);

    if (status & (STM32WB_SFSQI_SR_WEL | STM32WB_SFSQI_SR_WIP))
    {
	return true;
    }

    stm32wb_sfsqi_status(status);

    return false;
}

static bool stm32wb_sfsqi_suspend(void)
{
    uint8_t status, status2, scur;
    bool success;
    
    if (stm32wb_sfsqi_device.state != STM32WB_SFSQI_STATE_DATA)
    {
	return false;
    }

    if (stm32wb_sfsqi_device.busy & (STM32WB_SFSQI_BUSY_SUSPENDED_ERASE | STM32WB_SFSQI_BUSY_SUSPENDED_PROGRAM))
    {
	return false;
    }

    if (!stm32wb_sfsqi_busy())
    {
	return false;
    }
    
    stm32wb_sfsqi_command((stm32wb_sfsqi_device.busy & STM32WB_SFSQI_BUSY_ERASE) ? stm32wb_sfsqi_device.insn_erase_suspend : stm32wb_sfsqi_device.insn_program_suspend);

    do
    {
	status = stm32wb_sfsqi_command_read_1(STM32WB_SFSQI_INSN_RDSR);
    }
    while (status & (STM32WB_SFSQI_SR_WEL | STM32WB_SFSQI_SR_WIP));

    success = true;

    if (stm32wb_sfsqi_device.info.mid == STM32WB_SFSQI_MID_SPANSION)
    {
	status2 = stm32wb_sfsqi_command_read_1(STM32WB_SFSQI_INSN_RDSR2);
	
	if (!(status2 & (STM32WB_SFSQI_SR2_ES | STM32WB_SFSQI_SR2_PS)))
	{
	    success = false;
	}
    }
    
    if (stm32wb_sfsqi_device.info.mid == STM32WB_SFSQI_MID_MACRONIX)
    {
	scur = stm32wb_sfsqi_command_read_1(STM32WB_SFSQI_INSN_RDSCUR);
	
	if (!(scur & (STM32WB_SFSQI_SCUR_ESB | STM32WB_SFSQI_SCUR_PSB)))
	{
	    success = false;
	}
    }

    if (stm32wb_sfsqi_device.info.mid == STM32WB_SFSQI_MID_WINBOND)
    {
	stm32wb_sfsqi_command_read_2(STM32WB_SFSQI_INSN_RDSR, &status, &status2);

	if (!(status2 & STM32WB_SFSQI_SR2_SUS))
	{
	    success = false;
	}
    }
    
    if (success)
    {
	if (stm32wb_sfsqi_device.busy & STM32WB_SFSQI_BUSY_ERASE)
	{
	    stm32wb_sfsqi_device.busy = (stm32wb_sfsqi_device.busy & ~STM32WB_SFSQI_BUSY_ERASE) | STM32WB_SFSQI_BUSY_SUSPENDED_ERASE;
	}
	else
	{
	    stm32wb_sfsqi_device.busy = (stm32wb_sfsqi_device.busy & ~STM32WB_SFSQI_BUSY_PROGRAM) | STM32WB_SFSQI_BUSY_SUSPENDED_PROGRAM;
	}

