GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_sfsqi.c
	return true;
    }
    else
    {
	stm32wb_sfsqi_status(status);

	return false;
    }
}

static bool stm32wb_sfsqi_resume(void)
{
    if (stm32wb_sfsqi_device.state != STM32WB_SFSQI_STATE_DATA)
    {
	return false;
    }

    if (!(stm32wb_sfsqi_device.busy & (STM32WB_SFSQI_BUSY_SUSPENDED_ERASE | STM32WB_SFSQI_BUSY_SUSPENDED_PROGRAM)))
    {
	return false;
    }

    stm32wb_sfsqi_command((stm32wb_sfsqi_device.busy & STM32WB_SFSQI_BUSY_SUSPENDED_ERASE) ? stm32wb_sfsqi_device.insn_erase_resume : stm32wb_sfsqi_device.insn_program_resume);
    
    if (stm32wb_sfsqi_device.busy & STM32WB_SFSQI_BUSY_SUSPENDED_PROGRAM)
    {
	stm32wb_sfsqi_device.busy = (stm32wb_sfsqi_device.busy & ~STM32WB_SFSQI_BUSY_SUSPENDED_PROGRAM) | STM32WB_SFSQI_BUSY_PROGRAM;
    }
    else
    {
	stm32wb_sfsqi_device.busy = (stm32wb_sfsqi_device.busy & ~STM32WB_SFSQI_BUSY_SUSPENDED_ERASE) | STM32WB_SFSQI_BUSY_ERASE;
    }
    
    return true;
}

static bool stm32wb_sfsqi_erase(uint32_t address, volatile uint8_t *p_status_return)
{
    if (stm32wb_sfsqi_device.state != STM32WB_SFSQI_STATE_DATA)
    {
	return false;
    }

    if (stm32wb_sfsqi_device.busy & (STM32WB_SFSQI_BUSY_SUSPENDED_ERASE | STM32WB_SFSQI_BUSY_SUSPENDED_PROGRAM | STM32WB_SFSQI_BUSY_ERASE | STM32WB_SFSQI_BUSY_PROGRAM))
    {
	return false;
    }

    if (p_status_return)
    {
	*p_status_return = STM32WB_SFLASH_STATUS_BUSY;
    }
    
    stm32wb_sfsqi_device.p_status_return = p_status_return;
    stm32wb_sfsqi_device.busy = STM32WB_SFSQI_BUSY_ERASE;
    
    stm32wb_sfsqi_write_enable();

    stm32wb_sfsqi_command_erase(address);
    
    return true;
}

static bool stm32wb_sfsqi_program(uint32_t address, const uint8_t *data, uint32_t count, volatile uint8_t *p_status_return)
{
    if (stm32wb_sfsqi_device.state != STM32WB_SFSQI_STATE_DATA)
    {
	return false;
    }

    if (stm32wb_sfsqi_device.busy & (STM32WB_SFSQI_BUSY_SUSPENDED_ERASE | STM32WB_SFSQI_BUSY_SUSPENDED_PROGRAM | STM32WB_SFSQI_BUSY_ERASE | STM32WB_SFSQI_BUSY_PROGRAM))
    {
	return false;
    }
    
    if (p_status_return)
    {
	*p_status_return = STM32WB_SFLASH_STATUS_BUSY;
    }
    
    stm32wb_sfsqi_device.p_status_return = p_status_return;
    stm32wb_sfsqi_device.busy = STM32WB_SFSQI_BUSY_PROGRAM;

    stm32wb_sfsqi_write_enable();

    stm32wb_sfsqi_command_program(address, data, count);
    
    return true;
}

static bool stm32wb_sfsqi_read(uint32_t address, uint8_t *data, uint32_t count)
{
    if (stm32wb_sfsqi_device.state != STM32WB_SFSQI_STATE_DATA)
    {
	return false;
    }

    if (stm32wb_sfsqi_device.busy & (STM32WB_SFSQI_BUSY_ERASE | STM32WB_SFSQI_BUSY_PROGRAM))
    {
	return false;
    }
    
    stm32wb_sfsqi_command_read(address, data, count);
    
    return true;
}

static const stm32wb_sflash_interface_t stm32wb_sfsqi_interface = {
    stm32wb_sfsqi_acquire,
    stm32wb_sfsqi_release,
    stm32wb_sfsqi_busy,
    stm32wb_sfsqi_suspend,
    stm32wb_sfsqi_resume,
    stm32wb_sfsqi_erase,
    stm32wb_sfsqi_program,
    stm32wb_sfsqi_read,
};

bool stm32wb_sfsqi_initialize(const stm32wb_sfsqi_params_t *params)
{
    uint8_t MID, DID[2], status, status2, control, config1, config2;
    bool success, quad;
    
    if (stm32wb_sfsqi_device.state != STM32WB_SFSQI_STATE_NONE)
    {
	return false;
    }

    stm32wb_sfsqi_device.state = STM32WB_SFSQI_STATE_NOT_READY;
    stm32wb_sfsqi_device.pins = params->pins;

    stm32wb_sfsqi_device.QSPI = QUADSPI;

    stm32wb_sfsqi_device.clock = 8000000;
    stm32wb_sfsqi_device.hclk = 0;
    stm32wb_sfsqi_device.sclk = 0;
    
    stm32wb_gpio_pin_configure(stm32wb_sfsqi_device.pins.clk, (STM32WB_GPIO_PARK_HIZ | STM32WB_GPIO_PUPD_NONE | STM32WB_GPIO_OSPEED_VERY_HIGH | STM32WB_GPIO_OTYPE_PUSHPULL | STM32WB_GPIO_MODE_ALTERNATE));
    stm32wb_gpio_pin_configure(stm32wb_sfsqi_device.pins.cs, (STM32WB_GPIO_PARK_PULLUP | STM32WB_GPIO_PUPD_NONE | STM32WB_GPIO_OSPEED_VERY_HIGH | STM32WB_GPIO_OTYPE_PUSHPULL | STM32WB_GPIO_MODE_ALTERNATE));
    stm32wb_gpio_pin_configure(stm32wb_sfsqi_device.pins.io0, (STM32WB_GPIO_PARK_HIZ | STM32WB_GPIO_PUPD_NONE | STM32WB_GPIO_OSPEED_VERY_HIGH | STM32WB_GPIO_OTYPE_PUSHPULL | STM32WB_GPIO_MODE_ALTERNATE));
    stm32wb_gpio_pin_configure(stm32wb_sfsqi_device.pins.io1, (STM32WB_GPIO_PARK_HIZ | STM32WB_GPIO_PUPD_NONE | STM32WB_GPIO_OSPEED_VERY_HIGH | STM32WB_GPIO_OTYPE_PUSHPULL | STM32WB_GPIO_MODE_ALTERNATE));

    if ((stm32wb_sfsqi_device.pins.io2 != STM32WB_GPIO_PIN_NONE) && (stm32wb_sfsqi_device.pins.io3 != STM32WB_GPIO_PIN_NONE))
    {
	stm32wb_gpio_pin_configure(stm32wb_sfsqi_device.pins.io2, (STM32WB_GPIO_PARK_HIZ | STM32WB_GPIO_PUPD_NONE | STM32WB_GPIO_OSPEED_VERY_HIGH | STM32WB_GPIO_OTYPE_PUSHPULL | STM32WB_GPIO_MODE_ALTERNATE));
	stm32wb_gpio_pin_configure(stm32wb_sfsqi_device.pins.io3, (STM32WB_GPIO_PARK_HIZ | STM32WB_GPIO_PUPD_NONE | STM32WB_GPIO_OSPEED_VERY_HIGH | STM32WB_GPIO_OTYPE_PUSHPULL | STM32WB_GPIO_MODE_ALTERNATE));

	quad = true;
    }
    else
    {
	quad = false;
    }

    stm32wb_sfsqi_acquire();

    stm32wb_sfsqi_command(STM32WB_SFSQI_INSN_RDPD);
    
    armv7m_core_udelay(200);

    stm32wb_sfsqi_device.info.mid = stm32wb_sfsqi_command_signature();

    success = false;

    if (stm32wb_sfsqi_device.info.mid == STM32WB_SFSQI_MID_SPANSION)
    {
	success = true;
    }
    
    if (stm32wb_sfsqi_device.info.mid == STM32WB_SFSQI_MID_MACRONIX)
    {
	success = true;
    }

    if (stm32wb_sfsqi_device.info.mid == STM32WB_SFSQI_MID_WINBOND)
    {
	success = true;
    }

    if (success)
    {
	status = stm32wb_sfsqi_command_read_1(STM32WB_SFSQI_INSN_RDSR);
	
	if (status & (STM32WB_SFSQI_SR_WEL | STM32WB_SFSQI_SR_WIP))
	{
	    if (stm32wb_sfsqi_device.info.mid == STM32WB_SFSQI_MID_SPANSION)
	    {
		stm32wb_sfsqi_command(STM32WB_SFSQI_INSN_RESET);
	    }
	    else
	    {
		stm32wb_sfsqi_command(STM32WB_SFSQI_INSN_RSTEN);
		stm32wb_sfsqi_command(STM32WB_SFSQI_INSN_RST);
	    }
	    
	    armv7m_core_udelay(100);
	    
	    do
	    {
		status = stm32wb_sfsqi_command_read_1(STM32WB_SFSQI_INSN_RDSR);
	    } 
	    while (status & (STM32WB_SFSQI_SR_WEL | STM32WB_SFSQI_SR_WIP));
	}

	stm32wb_sfsqi_command_read_3(STM32WB_SFSQI_INSN_RDID, &MID, &DID[0], &DID[1]);

	if ((stm32wb_sfsqi_device.info.mid != MID) || ((DID[0] == 0x00) && (DID[1] == 0x00)) || ((DID[0] == 0xff) && (DID[1] == 0xff)))
	{
	    success = false;
	}
    }

    if (success)
    {
        stm32wb_sfsqi_device.info.did = (DID[0] << 8) | (DID[1] << 0);
        stm32wb_sfsqi_device.info.capacity = (1 << DID[1]);
        stm32wb_sfsqi_device.info.block_size = 65536;
        stm32wb_sfsqi_device.info.page_size = 256;
	
        stm32wb_sfsqi_device.clock = 32000000;
	
