GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/stm32wb_sfsqi.c
	stm32wb_sfsqi_device.ccr_erase = STM32WB_SFSQI_CCR_BLOCK_ERASE;
	stm32wb_sfsqi_device.ccr_program = STM32WB_SFSQI_CCR_1_1_1_PAGE_PROGRAM;
	stm32wb_sfsqi_device.ccr_read = STM32WB_SFSQI_CCR_1_1_1_FAST_READ;
	
	if (MID == STM32WB_SFSQI_MID_SPANSION)
	{
	    stm32wb_sfsqi_device.insn_erase_suspend = STM32WB_SFSQI_INSN_ERSP;
	    stm32wb_sfsqi_device.insn_erase_resume = STM32WB_SFSQI_INSN_ERRS;
	    stm32wb_sfsqi_device.insn_program_suspend = STM32WB_SFSQI_INSN_PGSP;
	    stm32wb_sfsqi_device.insn_program_resume = STM32WB_SFSQI_INSN_PGRS;

	    if (quad)
	    {
	        stm32wb_sfsqi_device.ccr_program = STM32WB_SFSQI_CCR_1_1_4_PAGE_PROGRAM;
		stm32wb_sfsqi_device.ccr_read = STM32WB_SFSQI_CCR_1_4_4_M2D4_READ;

		control = stm32wb_sfsqi_command_read_1(STM32WB_SFSQI_INSN_RDCR);
		
		if (!(control & STM32WB_SFSQI_CR_QE))
		{
		    status = stm32wb_sfsqi_write_enable();
		    
		    stm32wb_sfsqi_command_write_2(STM32WB_SFSQI_INSN_WRSR, status, (control | STM32WB_SFSQI_CR_QE));
		    
		    do
		    {
			status = stm32wb_sfsqi_command_read_1(STM32WB_SFSQI_INSN_RDSR);
		    } 
		    while (status & (STM32WB_SFSQI_SR_WEL | STM32WB_SFSQI_SR_WIP));
		}
	    }
	    else
	    {
		stm32wb_sfsqi_device.ccr_read = STM32WB_SFSQI_CCR_1_2_2_M2D2_READ;
	    }
	}

	if (MID == STM32WB_SFSQI_MID_MACRONIX)
	{
	    stm32wb_sfsqi_device.insn_erase_suspend = STM32WB_SFSQI_INSN_PERSUS;
	    stm32wb_sfsqi_device.insn_erase_resume = STM32WB_SFSQI_INSN_PERRSM;
	    stm32wb_sfsqi_device.insn_program_suspend = STM32WB_SFSQI_INSN_PERSUS;
	    stm32wb_sfsqi_device.insn_program_resume = STM32WB_SFSQI_INSN_PERRSM;

	    if (quad)
	    {
		if (DID[0] == 0x20)
		{
		    stm32wb_sfsqi_device.ccr_read = STM32WB_SFSQI_CCR_1_1_4_D8_READ;
		}
		else
		{
		    stm32wb_sfsqi_device.ccr_program = STM32WB_SFSQI_CCR_1_4_4_PAGE_PROGRAM;
		    stm32wb_sfsqi_device.ccr_read = STM32WB_SFSQI_CCR_1_4_4_M2D4_READ;
		}
			
		status = stm32wb_sfsqi_command_read_1(STM32WB_SFSQI_INSN_RDSR);

		if (!(status & STM32WB_SFSQI_SR_QE))
		{
		    status = stm32wb_sfsqi_write_enable();
		    
		    stm32wb_sfsqi_command_write_1(STM32WB_SFSQI_INSN_WRSR, (status | STM32WB_SFSQI_SR_QE));
		    
		    do
		    {
			status = stm32wb_sfsqi_command_read_1(STM32WB_SFSQI_INSN_RDSR);
		    } 
		    while (status & (STM32WB_SFSQI_SR_WEL | STM32WB_SFSQI_SR_WIP));
		}
	    }
	    else
	    {
		stm32wb_sfsqi_device.ccr_read = STM32WB_SFSQI_CCR_1_2_2_M2D2_READ;
	    }
	    
	    if (DID[0] == 0x28)
	    {
		stm32wb_sfsqi_command_read_2(STM32WB_SFSQI_INSN_RDCONF, &config1, &config2);

		if (!(config2 & STM32WB_SFSQI_CONF2_HPM))
		{
		    stm32wb_sfsqi_device.clock = 8000000;
		}
	    }
	}

	if (MID == STM32WB_SFSQI_MID_WINBOND)
	{
	    stm32wb_sfsqi_device.insn_erase_suspend = STM32WB_SFSQI_INSN_EPS;
	    stm32wb_sfsqi_device.insn_erase_resume = STM32WB_SFSQI_INSN_EPR;
	    stm32wb_sfsqi_device.insn_program_suspend = STM32WB_SFSQI_INSN_EPS;
	    stm32wb_sfsqi_device.insn_program_resume = STM32WB_SFSQI_INSN_EPR;

	    if (quad)
	    {
		stm32wb_sfsqi_device.ccr_program = STM32WB_SFSQI_CCR_1_1_4_PAGE_PROGRAM;
		stm32wb_sfsqi_device.ccr_read = STM32WB_SFSQI_CCR_1_4_4_M2D4_READ;

		stm32wb_sfsqi_command_read_2(STM32WB_SFSQI_INSN_RDSR, &status, &status2);

		if (!(status2 & STM32WB_SFSQI_SR2_QE))
		{
		    stm32wb_sfsqi_command(STM32WB_SFSQI_INSN_WREN_VOLATILE);
		    
		    stm32wb_sfsqi_command_write_2(STM32WB_SFSQI_INSN_WRSR, status, (status2 | STM32WB_SFSQI_SR2_QE));
		}
	    }
	    else
	    {
		stm32wb_sfsqi_device.ccr_read = STM32WB_SFSQI_CCR_1_2_2_M2D2_READ;
	    }
	}

	if (stm32wb_sfsqi_device.info.capacity > 0x01000000)
	{
	    if (MID == STM32WB_SFSQI_MID_SPANSION)
	    {
		stm32wb_sfsqi_command_write_1(STM32WB_SFSQI_INSN_BRWR, STM32WB_SFSQI_BR_EXTADD);
	    }
	    else
	    {
		stm32wb_sfsqi_command(STM32WB_SFSQI_INSN_EN4B);
	    }

	    stm32wb_sfsqi_device.ccr_erase |= QUADSPI_CCR_ADSIZE_0;
	    stm32wb_sfsqi_device.ccr_program |= QUADSPI_CCR_ADSIZE_0;
	    stm32wb_sfsqi_device.ccr_read |= QUADSPI_CCR_ADSIZE_0;
	}
	
	stm32wb_sfsqi_release();

	stm32wb_sfsqi_device.state = STM32WB_SFSQI_STATE_READY;
	stm32wb_sfsqi_device.hclk = 0;
	stm32wb_sfsqi_device.sclk = 0;

	stm32wb_system_register(&stm32wb_sfsqi_device.notify, (stm32wb_system_callback_t)stm32wb_sfsqi_sleep, NULL, STM32WB_SYSTEM_NOTIFY_SLEEP);
	
	__stm32wb_sflash_initialize(&stm32wb_sfsqi_interface, &stm32wb_sfsqi_device.info);
    }
    else
    {
	stm32wb_sfsqi_release();

	stm32wb_gpio_pin_configure(stm32wb_sfsqi_device.pins.clk, STM32WB_GPIO_MODE_ANALOG);
	stm32wb_gpio_pin_configure(stm32wb_sfsqi_device.pins.cs, STM32WB_GPIO_MODE_ANALOG);
	stm32wb_gpio_pin_configure(stm32wb_sfsqi_device.pins.io0, STM32WB_GPIO_MODE_ANALOG);
	stm32wb_gpio_pin_configure(stm32wb_sfsqi_device.pins.io1, STM32WB_GPIO_MODE_ANALOG);
	
	if ((stm32wb_sfsqi_device.pins.io2 != STM32WB_GPIO_PIN_NONE) && (stm32wb_sfsqi_device.pins.io3 != STM32WB_GPIO_PIN_NONE))
	{
	    stm32wb_gpio_pin_configure(stm32wb_sfsqi_device.pins.io2, STM32WB_GPIO_MODE_ANALOG);
	    stm32wb_gpio_pin_configure(stm32wb_sfsqi_device.pins.io3, STM32WB_GPIO_MODE_ANALOG);
	}

	stm32wb_sfsqi_device.state = STM32WB_SFSQI_STATE_NONE;
    }
    
    return success;
}
